

#=====读取文本1===========================================================
# open 传统方法 文件对象一直处于打开状态，直到是close()或关闭
#----------------------------------------------------------------
# input_file = 'file_to_read.txt'
# filereader = open(input_file,'r')
# for i in filereader:
# 	print(i.strip()) # strip() 去掉每一行两端的空格、制表符、换行符 
# filereader.close()
#----------------------------------------------------------------


#======读取文本2==========================================================
# with 结束时会自动关闭文件
#----------------------------------------------------------------
# input_file = 'file_to_read.txt'
# with open(input_file, 'r', newline='') as filereader:
# 	for i in filereader:
# 		print(i.strip())
#----------------------------------------------------------------


#=======读取多个文本文件=========================================================
# glob 处理的是文件夹 glob.glob()进行扩展处理
# os.path.join() 将这个文件夹路径和这个文件夹中所有符合特定模式的文件名连接起来
#----------------------------------------------------------------
# import glob
# import os
# input_path = 'folder_to_read'
# for input_file in glob.glob(os.path.join(input_path,'*.txt')):
# 	with open(input_file,'r',newline='') as filereader:
# 		for i in filereader:
# 			print(i.strip())
#----------------------------------------------------------------


#======写入文本文件txt==========================================================
# write() 将单个字符写入 writelines() 一系列字符串写入
#----------------------------------------------------------------
# my_letters = ['a','b','c','d','i','l','o','v','e','h']
# max_index = len(my_letters)
# output_file = 'write_to_file.txt'
# filewriter = open(output_file,'w') # w 是写入 a 是追加写入
# for i in range(max_index):
# 	if i < (max_index-1):
# 		filewriter.write(my_letters[i]+'\t')
# 	else:
# 		filewriter.write(my_letters[i]+'\n') # 此处做换行处理 是为了 下次追加写入 直接到下一行
# filewriter.close()
#----------------------------------------------------------------


#=======写入CSV文件=========================================================
# 
#----------------------------------------------------------------
my_numbers = [0,1,2,3,5,6,7,88,234,1233,1]
max_index = len(my_numbers)
output_file = 'write_to_file.txt'
filewriter = open(output_file,'a') # w 是写入 a 是追加写入
for i in range(max_index):
	if i < (max_index-1):
		filewriter.write(str(my_numbers[i])+',') # str()处理
	else:
		filewriter.write(str(my_numbers[i])+'\n')
filewriter.close()
#----------------------------------------------------------------


#================================================================
# 
#----------------------------------------------------------------

#----------------------------------------------------------------


#================================================================
# 
#----------------------------------------------------------------

#----------------------------------------------------------------


#================================================================
# 
#----------------------------------------------------------------

#----------------------------------------------------------------


#================================================================
# 
#----------------------------------------------------------------

#----------------------------------------------------------------

